# 아래의 기능을 구현하세요

# 1. 인증 초기 화면
# 회원가입, 또는 로그인 중 하나를 선택할 수 있습니다

# 2. 회원가입
# 이메일, 비밀번호, 유저 타입(구매자, 판매자)를 입력받고 회원 가입을 진행하세요
# 유저의 정보는 users.csv 파일에 저장하세요
# 중복된 이메일이 존재하는 경우 가입할 수 없습니다

# 3. 로그인
# 이메일, 비밀번호를 입력받고 로그인을 진행하세요
# 유저의 정보가 users.csv 파일에 존재하는지 확인하세요
# 존재한다면 유저의 이름으로 환영한다는 메세지를 출력하고 메인 화면을 보여주세요
# 존재하지 않다면 이메일 혹은 비밀번호가 일치하지 않는다는 메세지를 출력하고 다시 인증 초기 화면을 보여주세요

# 4. 로그아웃
# 메인 화면의 어떤 입력창에서도 exit를 입력하면 로그아웃이 됩니다
# 인증 초기 화면으로 돌아가세요

# 5. 구매자의 홈 화면
# 구매자의 이메일과 구매했던 상품 목록, 계좌의 잔액을 표시하세요
# 판매되고 있는 모든 상품 목록을 상품 아이디와 함께 표시하세요
# 상품 아이디를 입력받아 해당 상품을 구매할 수 있습니다

# 6. 판매자의 홈 화면
# 구매자의 이메일과 판매중인 상품 목록, 그리고 계좌의 잔액을 표시하세요
# 자신의 상품 목록을 상품 아이디와 함께 표시하세요
# 상품을 추가할 수 있습니다

# 7. 구매 절차
# 구매자가 상품의 아이디를 입력합니다
# csv 파일의 상품 목록에서 상품의 상태  판매 완료로 변경됩니다

# 8. 데이터
# csv 파일 첫 줄에 각 데이터에 필요한 속성들을 정리했습니다
# 객체의 정보가 변경되는 경우(set 함수를 사용하는 경우) 그 결과를 csv 파일에 반영할 수 있게 코드를 작성하세요
